Чистая/src/Documents/ПоступлениеДенежныхСредств/ПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

Чистая/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Чистая/src/Documents/ПоступлениеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвижениеВзаиморасчёты = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеВзаиморасчёты.ВидДвижения = ВидДвиженияНакопления.Приход; 
	ДвижениеВзаиморасчёты.Период = Дата;
	ДвижениеВзаиморасчёты.Контрагент = Плательщик;
	ДвижениеВзаиморасчёты.Ответственный = Ответственный;
	ДвижениеВзаиморасчёты.Сумма = Сумма;
	
КонецПроцедуры
